---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.CustomAxis
source: html/080c7d43-0546-b996-b0f1-6ca0ad79bc53.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.CustomAxis Property

The custom extrusion axis to try when generating an extrusion.

## Syntax (C#)
```csharp
public XYZ CustomAxis { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null